{"modelTopology": {"training_config": {"metrics": ["accuracy"], "loss": "binary_crossentropy", "optimizer_config": {"class_name": "SGD", "config": {"nesterov": false, "lr": 9.999999747378752e-05, "momentum": 0.8999999761581421, "decay": 0.0}}, "loss_weights": null, "sample_weight_mode": null}, "keras_version": "2.2.4", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[0, 1], [0, 1]], "trainable": true, "data_format": "channels_last", "name": "conv1_pad"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv1_pad"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv1"}, "inbound_nodes": [[["conv1_pad", 0, 0, {}]]], "name": "conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1_bn", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "conv1_bn"}, {"class_name": "ReLU", "config": {"threshold": 0.0, "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "name": "conv1_relu"}, "inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "name": "conv1_relu"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "bias_constraint": null, "depth_multiplier": 1, "trainable": true, "name": "conv_dw_1", "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "name": "conv_dw_1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_1_bn", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "name": "conv_dw_1_bn"}, {"class_name": "ReLU", "config": {"threshold": 0.0, "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "name": "conv_dw_1_relu"}, "inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "name": "conv_dw_1_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1], "name": "conv_pw_1"}, "inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "name": "conv_pw_1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_1_bn", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "name": "conv_pw_1_bn"}, {"class_name": "ReLU", "config": {"threshold": 0.0, "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "name": "conv_pw_1_relu"}, "inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "name": "conv_pw_1_relu"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[0, 1], [0, 1]], "trainable": true, "data_format": "channels_last", "name": "conv_pad_2"}, "inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "name": "conv_pad_2"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "bias_constraint": null, "depth_multiplier": 1, "trainable": true, "name": "conv_dw_2", "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv_pad_2", 0, 0, {}]]], "name": "conv_dw_2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_2_bn", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "name": "conv_dw_2_bn"}, {"class_name": "ReLU", "config": {"threshold": 0.0, "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "name": "conv_dw_2_relu"}, "inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "name": "conv_dw_2_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1], "name": "conv_pw_2"}, "inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "name": "conv_pw_2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_2_bn", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "name": "conv_pw_2_bn"}, {"class_name": "ReLU", "config": {"threshold": 0.0, "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "name": "conv_pw_2_relu"}, "inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "name": "conv_pw_2_relu"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "bias_constraint": null, "depth_multiplier": 1, "trainable": true, "name": "conv_dw_3", "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "name": "conv_dw_3"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_3_bn", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "name": "conv_dw_3_bn"}, {"class_name": "ReLU", "config": {"threshold": 0.0, "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "name": "conv_dw_3_relu"}, "inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "name": "conv_dw_3_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1], "name": "conv_pw_3"}, "inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "name": "conv_pw_3"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_3_bn", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "name": "conv_pw_3_bn"}, {"class_name": "ReLU", "config": {"threshold": 0.0, "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "name": "conv_pw_3_relu"}, "inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "name": "conv_pw_3_relu"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[0, 1], [0, 1]], "trainable": true, "data_format": "channels_last", "name": "conv_pad_4"}, "inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "name": "conv_pad_4"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "bias_constraint": null, "depth_multiplier": 1, "trainable": true, "name": "conv_dw_4", "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv_pad_4", 0, 0, {}]]], "name": "conv_dw_4"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_4_bn", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "name": "conv_dw_4_bn"}, {"class_name": "ReLU", "config": {"threshold": 0.0, "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "name": "conv_dw_4_relu"}, "inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "name": "conv_dw_4_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1], "name": "conv_pw_4"}, "inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "name": "conv_pw_4"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_4_bn", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "name": "conv_pw_4_bn"}, {"class_name": "ReLU", "config": {"threshold": 0.0, "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "name": "conv_pw_4_relu"}, "inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "name": "conv_pw_4_relu"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "bias_constraint": null, "depth_multiplier": 1, "trainable": true, "name": "conv_dw_5", "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "name": "conv_dw_5"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_5_bn", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "name": "conv_dw_5_bn"}, {"class_name": "ReLU", "config": {"threshold": 0.0, "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "name": "conv_dw_5_relu"}, "inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "name": "conv_dw_5_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1], "name": "conv_pw_5"}, "inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "name": "conv_pw_5"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_5_bn", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "name": "conv_pw_5_bn"}, {"class_name": "ReLU", "config": {"threshold": 0.0, "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "name": "conv_pw_5_relu"}, "inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "name": "conv_pw_5_relu"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[0, 1], [0, 1]], "trainable": true, "data_format": "channels_last", "name": "conv_pad_6"}, "inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "name": "conv_pad_6"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "bias_constraint": null, "depth_multiplier": 1, "trainable": true, "name": "conv_dw_6", "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv_pad_6", 0, 0, {}]]], "name": "conv_dw_6"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_6_bn", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "name": "conv_dw_6_bn"}, {"class_name": "ReLU", "config": {"threshold": 0.0, "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "name": "conv_dw_6_relu"}, "inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "name": "conv_dw_6_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1], "name": "conv_pw_6"}, "inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "name": "conv_pw_6"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_6_bn", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "name": "conv_pw_6_bn"}, {"class_name": "ReLU", "config": {"threshold": 0.0, "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "name": "conv_pw_6_relu"}, "inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "name": "conv_pw_6_relu"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "bias_constraint": null, "depth_multiplier": 1, "trainable": true, "name": "conv_dw_7", "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "name": "conv_dw_7"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_7_bn", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "name": "conv_dw_7_bn"}, {"class_name": "ReLU", "config": {"threshold": 0.0, "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "name": "conv_dw_7_relu"}, "inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "name": "conv_dw_7_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1], "name": "conv_pw_7"}, "inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "name": "conv_pw_7"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_7_bn", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "name": "conv_pw_7_bn"}, {"class_name": "ReLU", "config": {"threshold": 0.0, "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "name": "conv_pw_7_relu"}, "inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "name": "conv_pw_7_relu"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "bias_constraint": null, "depth_multiplier": 1, "trainable": true, "name": "conv_dw_8", "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "name": "conv_dw_8"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_8_bn", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "name": "conv_dw_8_bn"}, {"class_name": "ReLU", "config": {"threshold": 0.0, "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "name": "conv_dw_8_relu"}, "inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "name": "conv_dw_8_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1], "name": "conv_pw_8"}, "inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "name": "conv_pw_8"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_8_bn", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "name": "conv_pw_8_bn"}, {"class_name": "ReLU", "config": {"threshold": 0.0, "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "name": "conv_pw_8_relu"}, "inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "name": "conv_pw_8_relu"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "bias_constraint": null, "depth_multiplier": 1, "trainable": true, "name": "conv_dw_9", "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "name": "conv_dw_9"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_9_bn", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "name": "conv_dw_9_bn"}, {"class_name": "ReLU", "config": {"threshold": 0.0, "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "name": "conv_dw_9_relu"}, "inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "name": "conv_dw_9_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1], "name": "conv_pw_9"}, "inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "name": "conv_pw_9"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_9_bn", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "name": "conv_pw_9_bn"}, {"class_name": "ReLU", "config": {"threshold": 0.0, "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "name": "conv_pw_9_relu"}, "inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "name": "conv_pw_9_relu"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "bias_constraint": null, "depth_multiplier": 1, "trainable": true, "name": "conv_dw_10", "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "name": "conv_dw_10"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_10_bn", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "name": "conv_dw_10_bn"}, {"class_name": "ReLU", "config": {"threshold": 0.0, "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "name": "conv_dw_10_relu"}, "inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "name": "conv_dw_10_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1], "name": "conv_pw_10"}, "inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "name": "conv_pw_10"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_10_bn", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "name": "conv_pw_10_bn"}, {"class_name": "ReLU", "config": {"threshold": 0.0, "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "name": "conv_pw_10_relu"}, "inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "name": "conv_pw_10_relu"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "bias_constraint": null, "depth_multiplier": 1, "trainable": true, "name": "conv_dw_11", "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "name": "conv_dw_11"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_11_bn", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "name": "conv_dw_11_bn"}, {"class_name": "ReLU", "config": {"threshold": 0.0, "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "name": "conv_dw_11_relu"}, "inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "name": "conv_dw_11_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1], "name": "conv_pw_11"}, "inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "name": "conv_pw_11"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_11_bn", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "name": "conv_pw_11_bn"}, {"class_name": "ReLU", "config": {"threshold": 0.0, "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "name": "conv_pw_11_relu"}, "inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "name": "conv_pw_11_relu"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[0, 1], [0, 1]], "trainable": true, "data_format": "channels_last", "name": "conv_pad_12"}, "inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "name": "conv_pad_12"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "bias_constraint": null, "depth_multiplier": 1, "trainable": true, "name": "conv_dw_12", "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv_pad_12", 0, 0, {}]]], "name": "conv_dw_12"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_12_bn", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "name": "conv_dw_12_bn"}, {"class_name": "ReLU", "config": {"threshold": 0.0, "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "name": "conv_dw_12_relu"}, "inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "name": "conv_dw_12_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 1024, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1], "name": "conv_pw_12"}, "inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "name": "conv_pw_12"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_12_bn", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "name": "conv_pw_12_bn"}, {"class_name": "ReLU", "config": {"threshold": 0.0, "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "name": "conv_pw_12_relu"}, "inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "name": "conv_pw_12_relu"}, {"class_name": "DepthwiseConv2D", "config": {"use_bias": false, "bias_constraint": null, "depth_multiplier": 1, "trainable": true, "name": "conv_dw_13", "bias_regularizer": null, "depthwise_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]], "name": "conv_dw_13"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_dw_13_bn", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["conv_dw_13", 0, 0, {}]]], "name": "conv_dw_13_bn"}, {"class_name": "ReLU", "config": {"threshold": 0.0, "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "name": "conv_dw_13_relu"}, "inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]], "name": "conv_dw_13_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 1024, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1], "name": "conv_pw_13"}, "inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]], "name": "conv_pw_13"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv_pw_13_bn", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "scale": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["conv_pw_13", 0, 0, {}]]], "name": "conv_pw_13_bn"}, {"class_name": "ReLU", "config": {"threshold": 0.0, "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "name": "conv_pw_13_relu"}, "inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]], "name": "conv_pw_13_relu"}], "output_layers": [["conv_pw_13_relu", 0, 0]], "name": "mobilenet_1.00_224", "input_layers": [["input_1", 0, 0]]}}, {"class_name": "Flatten", "config": {"dtype": "float32", "batch_input_shape": [null, 7, 7, 1024], "trainable": true, "data_format": "channels_last", "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null, "name": "dense_1"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.5, "trainable": true, "seed": null, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null, "name": "dense_2"}}], "name": "sequential_1"}}, "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of16", "group1-shard2of16", "group1-shard3of16", "group1-shard4of16", "group1-shard5of16", "group1-shard6of16", "group1-shard7of16", "group1-shard8of16", "group1-shard9of16", "group1-shard10of16", "group1-shard11of16", "group1-shard12of16", "group1-shard13of16", "group1-shard14of16", "group1-shard15of16", "group1-shard16of16"], "weights": [{"dtype": "float32", "shape": [50176, 256], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [256], "name": "dense_1/bias"}, {"dtype": "float32", "shape": [256, 1], "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [1], "name": "dense_2/bias"}, {"dtype": "float32", "shape": [3, 3, 3, 32], "name": "conv1/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv1_bn/gamma"}, {"dtype": "float32", "shape": [32], "name": "conv1_bn/beta"}, {"dtype": "float32", "shape": [3, 3, 32, 1], "name": "conv_dw_1/depthwise_kernel"}, {"dtype": "float32", "shape": [32], "name": "conv_dw_1_bn/gamma"}, {"dtype": "float32", "shape": [32], "name": "conv_dw_1_bn/beta"}, {"dtype": "float32", "shape": [1, 1, 32, 64], "name": "conv_pw_1/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv_pw_1_bn/gamma"}, {"dtype": "float32", "shape": [64], "name": "conv_pw_1_bn/beta"}, {"dtype": "float32", "shape": [3, 3, 64, 1], "name": "conv_dw_2/depthwise_kernel"}, {"dtype": "float32", "shape": [64], "name": "conv_dw_2_bn/gamma"}, {"dtype": "float32", "shape": [64], "name": "conv_dw_2_bn/beta"}, {"dtype": "float32", "shape": [1, 1, 64, 128], "name": "conv_pw_2/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv_pw_2_bn/gamma"}, {"dtype": "float32", "shape": [128], "name": "conv_pw_2_bn/beta"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "conv_dw_3/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "conv_dw_3_bn/gamma"}, {"dtype": "float32", "shape": [128], "name": "conv_dw_3_bn/beta"}, {"dtype": "float32", "shape": [1, 1, 128, 128], "name": "conv_pw_3/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv_pw_3_bn/gamma"}, {"dtype": "float32", "shape": [128], "name": "conv_pw_3_bn/beta"}, {"dtype": "float32", "shape": [3, 3, 128, 1], "name": "conv_dw_4/depthwise_kernel"}, {"dtype": "float32", "shape": [128], "name": "conv_dw_4_bn/gamma"}, {"dtype": "float32", "shape": [128], "name": "conv_dw_4_bn/beta"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "name": "conv_pw_4/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv_pw_4_bn/gamma"}, {"dtype": "float32", "shape": [256], "name": "conv_pw_4_bn/beta"}, {"dtype": "float32", "shape": [3, 3, 256, 1], "name": "conv_dw_5/depthwise_kernel"}, {"dtype": "float32", "shape": [256], "name": "conv_dw_5_bn/gamma"}, {"dtype": "float32", "shape": [256], "name": "conv_dw_5_bn/beta"}, {"dtype": "float32", "shape": [1, 1, 256, 256], "name": "conv_pw_5/kernel"}, {"dtype": "float32", "shape": [256], "name": "conv_pw_5_bn/gamma"}, {"dtype": "float32", "shape": [256], "name": "conv_pw_5_bn/beta"}, {"dtype": "float32", "shape": [3, 3, 256, 1], "name": "conv_dw_6/depthwise_kernel"}, {"dtype": "float32", "shape": [256], "name": "conv_dw_6_bn/gamma"}, {"dtype": "float32", "shape": [256], "name": "conv_dw_6_bn/beta"}, {"dtype": "float32", "shape": [1, 1, 256, 512], "name": "conv_pw_6/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_6_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_6_bn/beta"}, {"dtype": "float32", "shape": [3, 3, 512, 1], "name": "conv_dw_7/depthwise_kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_7_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_7_bn/beta"}, {"dtype": "float32", "shape": [1, 1, 512, 512], "name": "conv_pw_7/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_7_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_7_bn/beta"}, {"dtype": "float32", "shape": [3, 3, 512, 1], "name": "conv_dw_8/depthwise_kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_8_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_8_bn/beta"}, {"dtype": "float32", "shape": [1, 1, 512, 512], "name": "conv_pw_8/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_8_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_8_bn/beta"}, {"dtype": "float32", "shape": [3, 3, 512, 1], "name": "conv_dw_9/depthwise_kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_9_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_9_bn/beta"}, {"dtype": "float32", "shape": [1, 1, 512, 512], "name": "conv_pw_9/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_9_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_9_bn/beta"}, {"dtype": "float32", "shape": [3, 3, 512, 1], "name": "conv_dw_10/depthwise_kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_10_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_10_bn/beta"}, {"dtype": "float32", "shape": [1, 1, 512, 512], "name": "conv_pw_10/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_10_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_10_bn/beta"}, {"dtype": "float32", "shape": [3, 3, 512, 1], "name": "conv_dw_11/depthwise_kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_11_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_11_bn/beta"}, {"dtype": "float32", "shape": [1, 1, 512, 512], "name": "conv_pw_11/kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_11_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_pw_11_bn/beta"}, {"dtype": "float32", "shape": [3, 3, 512, 1], "name": "conv_dw_12/depthwise_kernel"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_12_bn/gamma"}, {"dtype": "float32", "shape": [512], "name": "conv_dw_12_bn/beta"}, {"dtype": "float32", "shape": [1, 1, 512, 1024], "name": "conv_pw_12/kernel"}, {"dtype": "float32", "shape": [1024], "name": "conv_pw_12_bn/gamma"}, {"dtype": "float32", "shape": [1024], "name": "conv_pw_12_bn/beta"}, {"dtype": "float32", "shape": [3, 3, 1024, 1], "name": "conv_dw_13/depthwise_kernel"}, {"dtype": "float32", "shape": [1024], "name": "conv_dw_13_bn/gamma"}, {"dtype": "float32", "shape": [1024], "name": "conv_dw_13_bn/beta"}, {"dtype": "float32", "shape": [1, 1, 1024, 1024], "name": "conv_pw_13/kernel"}, {"dtype": "float32", "shape": [1024], "name": "conv_pw_13_bn/gamma"}, {"dtype": "float32", "shape": [1024], "name": "conv_pw_13_bn/beta"}, {"dtype": "float32", 